package Lesson2;

/*

Тип данных - это множество допустимых значений этих даных,
а так же совокупность операций над ними.

Переменная - именованная область памяти, адрес которой можно
использовать для осуществления доступа к данным и манипуляций
над ними в ходе выполнения программы.


Составные части переменной:
1. Тип;
2. Имя;
3. Размер;
4. Значение.

а = 5 <- а это имя переменной, 5 это значение переменной.
5 это число которое занимает какое то кол-во памяти.

Типы данных:

Примитивные типы данных и ссылочные типы данных.

Примитивные типы:

1. Численные (numeric);
2. Символьные (Character) -> char;
3. Логический (Boolean) -> boolean.

Численные типы данных:

1) Целочисленные;
2) Дробные.

Целочисленные:

           Размер:    Диапазон:
1) byte;    8 бит     [-128;127]
2) int;     16 бит    [-32768;32767]
3) short;   32 бит    [-2147483648;2147483647]
4) long.    64 бит    [-9223372036854775808;9223372036854775807]

Дробные:
            Размер:    Диапазон:
1) float;    32 бит    [3.4e-38;3.4e+38]
2) double.   64 бит    [1.7e-308;1.7e+308]


Символьный:

             Размер:    Диапазон:
char.        16 бит     [0;65535]


Логический:
             Размер:    Диапазон:
boolean.        -       {true;false}


Сначала указывается тип данных (int) потом название переменной (а) знак
равенста (=) и начение переменной (5).

int - тип данных по умолчанию у целочисленных типов даннх;
double - тип данных по умолчанию у дробных типов даннх;

Значение символьного типа char всегда должно находиться в кавычках ''.

Системы счислений:

2-ичная {0,1};   <- только 0 и 1
8-ричная {0-7}   <- нельзя использовать 8 и 9 (57 можно, а 92 нельзая)
10-ричная {0-9}  <- любые цифры
16-ричная{0-F}   <- любые цифры + ABCDEF

 */



