/*

           ----------Non-access Modifier----------
           |                  |                  |
         final              static            abstract


                   ----------final----------
                   |            |          |
              переменные      метод        класс

final в переменной позволяет делать переменную не изменяемой.

                   ----------static----------
                  |                          |
                метод                    переменная



 */